{
  "内科": [
    "【核心定位】主要症状是否适合通过药物、生活方式干预等非手术方式治疗？目标是识别并管理慢性病、感染、代谢及免疫系统疾病。",
    "【必问-治疗方式】首先询问：'您目前的症状，是否考虑过或被建议过需要手术治疗？'",
    "【必问-排除外科】'最近是否有过任何形式的摔倒、撞击或外伤？' '腹部疼痛是否剧烈且持续，或者有无固定位置的压痛、反跳痛？'",
    "【急症/危险信号】胸痛/胸闷需警惕心梗，追问 '是否像大石压榨感？有无向左肩、后背放射？'；呼吸困难需警惕心衰/肺栓塞；单侧肢体无力/麻木需警惕脑卒中。",
    "【肿瘤科鉴别】[触发词：肿瘤、癌症、化疗、放疗、靶向治疗] 【追问】'您目前的症状，是与肿瘤本身（如肿瘤压迫、咯血）或治疗副作用（如化疗后恶心）直接相关，还是一个新发的、独立的健康问题（如感冒、胃炎）？'",
    "【心血管鉴别】[触发词：胸痛、心慌、胸闷] 【追问】'疼痛是否与活动有关？休息后能缓解吗？持续多长时间？' 这是为了区分稳定性心绞痛（内科）和需要紧急干预的情况。",
    "【神经内科vs神经外科】[重点：排除外科急症] 【必问】'头部症状前有无外伤？' 【追问】'若无外伤，是否做过头颅CT或MRI检查？结果提示有无出血或占位？' '头痛是否是突发的、前所未有的剧烈疼痛（炸裂感）？' 若无以上外科指征，则倾向于内科问题。",
    "【感染性疾病】[触发词：发热、寒战] 【追问】'除了发烧，有无咳嗽、腹泻、尿痛等指向具体感染部位的症状？' 以便定位到具体的内科亚专科（呼吸、消化、肾内）。",
    "【内分泌科vs神经内科】[触发词：四肢麻木、无力] 【必问】'您有糖尿病史吗？近期血糖控制得怎么样？' 【追问】'麻木/无力是从脚趾或手指开始的对称性感觉，还是单侧肢体或局部区域的？' (对称性远端→内分泌科；非对称/局部→神经内科）"
  ],
  "外科": [
    "【核心定位】主要症状是否由外伤、感染性包块、结构异常或实体肿瘤引起，且可能需要手术、穿刺或介入等有创操作？",
    "【必问-外伤史】对任何部位的疼痛、肿胀、功能障碍，【第一问题】必须是：'这个症状出现前，您有无相关的外伤、撞击或扭伤经历？'",
    "【必问-肿块性质】[触发词：肿块、包、疙瘩] 【追问四要素】'这个肿块在哪个位置？发现多久了，大小有无变化？按压时是否疼痛？能否被推动？'",
    "【急腹症筛查】[触发词：腹痛] 【追问】'疼痛最开始在哪个部位，现在在哪个部位？（确认有无转移性疼痛）' '咳嗽或按压腹部时疼痛会加剧吗？（确认有无腹膜炎）' '有无停止排气排便？（确认有无肠梗阻）'",
    "【神经外科vs神经内科】[重点：确认手术指征] 【必问】'有无头部外伤史？' 【追问】'若无外伤，CT/MRI影像结果是什么？（直接寻找出血、占位、脑积水等手术证据）' '若无影像，头痛是否为突发“炸裂样”剧痛，并伴有恶心呕吐？'（高度怀疑外科急症）",
    "【骨科鉴别】[触发词：肢体/关节疼痛] 【追问】'请明确指出最痛的点是在骨头上、关节里，还是肌肉上？' '疼痛是如何发生的，是急性扭伤还是慢性劳损？'",
    "【肝胆外科鉴别】[触发词：右上腹痛] 【追问】'疼痛是否在进食油腻食物后加重？有无向右侧肩膀放射？皮肤或眼睛有无发黄？' 'B超是否提示有胆囊结石或胆囊炎？'",
    "【泌尿外科鉴别】[触发词：腰痛、排尿异常] 【追问】'腰痛是否为剧烈绞痛，并向下腹部放射？' '排尿时有无中断或排尿困难？' （优先排查结石、梗阻）"
  ],
  "儿科": [
    "【年龄优先原则】询问患者年龄，【硬规则】小于等于14周岁，优先考虑儿科，特殊情况（如14-18岁）需结合具体疾病判断。",
    "【急症/危险信号】高热伴精神萎靡/惊厥、呼吸急促伴鼻翼煽动/三凹征、严重呕吐腹泻导致尿少/无泪，需立即作为急症处理。",
    "【区别成人科室】禁止直接套用成人逻辑。例如，儿童腹痛需特别询问有无肠套叠（果酱样便）、过敏史；儿童咳嗽需关注有无哮喘史、异物吸入史。",
    "【发育与行为】'孩子的生长发育（身高体重）、说话、走路等与同龄孩子比怎么样？' 这是一个关键的背景信息。",
    "【家长代述引导】引导家长准确描述：'您能模仿一下孩子的咳嗽声吗？' '孩子哭闹时是烦躁不安还是固定姿势不敢动？'"
  ],
  "妇产科": [
    "【性别与年龄筛查】确认患者为女性，并处于育龄期（约14-50岁）。",
    "【必问-妊娠可能】对于育龄期女性的所有主诉（尤其是腹痛、恶心、异常出血），【第一问题】必须是：'您最近一次月经是什么时候？是否有怀孕的可能？'",
    "【必问-月经史】'您的月经周期规律吗？每次持续几天？量多还是少？有无严重痛经？'",
    "【急症/危险信号】急性下腹痛需追问'疼痛是撕裂样还是绞痛？有无晕厥？'（警惕宫外孕破裂）；孕期任何阴道流血、腹痛、胎动异常均属急症。",
    "【鉴别内科】[触发词：腹痛、恶心] 在排除消化系统问题的同时，必须追问：'这些症状与您的月经周期有关吗？' '白带有没有异常增多或变色？'"
  ],
  "皮肤性病科": [
    "【核心定位】症状是否以皮肤、黏膜、毛发、指甲的可见病变为主要表现？",
    "【必问-皮损描述】引导患者描述：'皮疹是什么样子的（红点、水疱、脓疱）？' '除了痒，有没有疼痛或灼热感？' '是从哪里最先开始长的？'",
    "【鉴别外科/感染科】[触发词：红肿、疼痛] 【追问】'红肿区域的边界清楚吗？发展速度快不快？' '在出现皮肤问题前，局部有无被蚊虫叮咬或刮伤？'（外科感染常有诱因且发展迅速）",
    "【带状疱疹特征】[触发词：水疱、疼痛] 【追问】'疼痛和水疱是否只在身体的一侧，呈条带状分布，并且不超过中线？'",
    "【过敏/接触史】'最近有无接触新的化学品、宠物、植物，或者吃过不常吃的食物、药物？'"
  ],

  "口腔科": [
    "【口腔局限性】症状主要局限在口腔、牙齿、颌面部",
    "【vs耳鼻咽喉科】口咽部症状需要区分：口腔问题 vs 咽喉问题",
    "【vs普外科】颌面外伤需要专科口腔颌面外科处理",
    "【牙齿相关】询问牙痛、牙龈出血、牙齿松动",
    "【颌面部症状】询问咀嚼困难、张口受限",
    "【口腔肿物】询问口腔内肿块、溃疡"
  ],
    "眼科": [
      "【核心定位】症状是否主要集中在眼部（结构、功能、感觉）或视觉通路？",
      "【急症/危险信号】[触发词：突然、剧烈] 【必问】'视力是否是突然发生的、急剧的下降？' '眼前有无像窗帘、黑幕遮挡的感觉？' '眼痛是否非常剧烈，并伴有头痛、恶心呕吐？'（分别警惕视网膜脱离、急性青光眼等）",
      "【必问-视觉症状】引导患者描述：'您感受到的具体视觉问题是什么？是视力模糊、看东西变形、一个变两个（复视）、眼前有黑影/飞蚊、看到闪光，还是视野某个方向看不见了？'",
      "【必问-外伤史】'您的眼部最近有无受到过撞击、刮擦或有异物进入？'",
      "【鉴别-vs神经内科】[触发词：视力改变、复视] 【追问】'出现视觉问题时，是否伴随有头痛、口齿不清、单侧手脚无力或麻木等其他症状？' (若有，需高度怀疑神经系统疾病)",
      "【追问-慢性病】'您是否有青光眼、白内障、糖尿病或高血压的病史？'（这些是许多眼病的危险因素）"
    ],
    "肿瘤科": [
      "【核心定位】患者的主诉是否与已知或高度疑似的恶性肿瘤直接相关？包括肿瘤本身、转移、治疗副作用或相关全身症状。",
      "【必问-患者分类】首先界定患者类型：'您是已经确诊了肿瘤，还是因为怀疑有肿瘤来就诊？'",
      "【追问-确诊患者】'您的肿瘤诊断是什么？分期是多少？目前正在接受或刚结束什么治疗（如手术、化疗、放疗、靶向治疗）？'",
      "【追问-疑似患者/报警症状】[触发词：肿块、消瘦、不明原因疼痛] 【追问】'近几个月有无无法解释的体重明显下降？' '有无持续存在且无法缓解的疼痛或疲劳感？' '有无夜间出汗、不明原因发热？'",
      "【鉴别-并发症vs新发病】[针对确诊患者] 【必问】'您目前的不适，您觉得是与肿瘤/治疗直接相关（如化疗后恶心），还是像一个全新的问题（如感冒、拉肚子）？' 若为后者，引导至相应内科科室。",
      "【鉴别-治疗方式(vs外科)】【追问】'关于您的病情，医生给出的主要建议是手术切除，还是以化疗、放疗等全身或局部治疗为主？'"
    ],
    "耳鼻咽喉科": [
      "【核心定位】症状是否局限于耳、鼻、咽、喉、颈部区域？",
      "【急症/危险信号】[触发词：突然、呼吸困难、眩晕] 【必问】'听力是否突然下降？' '有无感觉天旋地转、站不稳，并伴有恶心呕吐？' '有无喉咙被卡住的感觉或呼吸困难？' '吞咽时是否有呛咳？'",
      "【必问-核心症状】'请问您的主要不适是听力问题、鼻子问题（鼻塞/流涕/出血）、还是咽喉问题（咽痛/异物感/声音嘶哑）？'",
      "【鉴别-vs口腔科】[触发词：嘴里/喉咙不适] 【追问】'您能否用手指明确指出不适的最主要位置？是在牙齿/舌头/口腔黏膜上，还是在喉咙深处？'",
      "【鉴别-vs呼吸内科】[触发词：咳嗽] 【追问】'咳嗽的同时，是否伴有胸闷、气喘或大量浓痰？' (若有，则呼吸内科可能性增大)",
      "【追问-听力】'是单耳还是双耳听力下降？有无耳鸣或耳闷的感觉？'",
      "【追问-咽喉】'声音嘶哑持续多久了？吞咽时有无疼痛或困难？'"
    ],
    "康复科": [
      "【核心定位】患者是否在急性疾病/损伤治疗后，仍存在功能障碍，核心需求是改善功能、减轻疼痛、提高生活质量？",
      "【核心询问-功能状态】'您目前的疾病或损伤，对您完成日常生活（如穿衣、吃饭、走路、上下楼梯）造成了哪些具体困难？'",
      "【鉴别-治疗阶段(vs神经/骨科)】【必问】'您目前是处于疾病的急性发作期和治疗期，还是在寻求后续的功能恢复和长期管理？' (前者属于神经/骨科，后者属于康复科)",
      "【追问-康复目标】'您最希望通过治疗改善哪个方面的问题？是减轻疼痛，还是希望能走得更远，或是让手部活动更灵活？'",
      "【追问-慢性疼痛】'对于您的慢性疼痛，您目前的主要想法是找到病因并根治它，还是学习如何更好地控制疼痛、与它共存并改善日常活动能力？'"
    ],
    "精神科": [
      "【核心定位】患者的主要困扰是否为情绪、思维、认知、行为或睡眠等精神心理方面的问题？",
      "【最高优先级-安全评估】[触发词：不想活、绝望、伤害] 【必问】'最近一段时间，您是否有过伤害自己或他人的想法或行为？' (此为安全红线，需最优先处理)",
      "【必问-核心症状】'您最近在情绪上（如持续低落、过度紧张）、想法上（如胡思乱想、感觉被监视）或行为上（如回避社交、重复检查）有什么让您很困扰的变化吗？'",
      "【鉴别-器质性vs功能性(vs神经内科)】【追问】'在出现这些情绪/行为问题前后，您身体上是否有其他不适，比如有没有发烧、头痛、意识模糊，或者使用过特殊的药物/物质？' (旨在排除器质性脑病导致的继发性精神症状)",
      "【追问-社会功能】'这些问题对您的工作、学习、家庭生活或人际交往造成了多大的影响？'",
      "【追问-病史】'以前是否有过类似的情况？是否看过心理医生或精神科医生？'"
    ],
    "全科": [
      "【核心定位】适用于症状不明确、涉及多系统、需要长期慢病综合管理或寻求初步健康评估的患者。",
      "【适用场景-询问引导】'您的症状比较复杂，不太像单一科室的问题，您是希望先找一位全科医生做个全面评估和初步诊断，再决定是否需要转诊专科吗？'",
      "【适用场景-多病共存】'您是否同时有多种慢性病（比如高血压、糖尿病、关节炎等），希望有医生能帮您进行综合管理？'",
      "【适用场景-预防保健】'您是没有特殊不适，只是想做一次全面的健康咨询或常规检查吗？'"
    ],
    "体检科": [
      "【核心定位】为无症状的健康或亚健康人群提供系统性的健康状况筛查和评估。",
      "【必问-症状筛查】'请问您本次来医院，是因为身体出现了某些不舒服的症状需要看病，还是在没有症状的情况下，专门来进行健康体检的？'",
      "【硬规则】如果患者回答“有症状”，则【禁止】分诊至体检科，应根据其症状引导至相应临床科室。",
      "【适用场景-询问引导】'您是需要常规的年度体检，还是有特定目的（如单位入职、个人防癌筛查等）的检查项目？'"
    ]
  }